src/test/resources/fixtures/order_cancellations.json

{
  "data": [
    {
      "confirmed_at": "2022-07-22T13:49:38.375809Z",
      "created_at": "2022-07-22T13:49:37.939379Z",
      "expires_at": "2022-07-22T14:49:37Z",
      "id": "ore_0000ALkehDZNVjfc8WypTP",
      "live_mode": false,
      "order_id": "ord_0000ALkeh5Njx7bik7TQDh",
      "refund_amount": "26.30",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": "2022-07-22T13:48:55.703547Z",
      "created_at": "2022-07-22T13:48:55.482882Z",
      "expires_at": "2022-07-22T14:48:55Z",
      "id": "ore_0000ALkedIrf1OuvETjdpZ",
      "live_mode": false,
      "order_id": "ord_0000ALkedG1TaRzCQ3IwDL",
      "refund_amount": "686.24",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": null,
      "created_at": "2022-07-22T13:45:14.897406Z",
      "expires_at": "2022-07-22T14:45:14Z",
      "id": "ore_0000ALkeIxcuQPCDKjE1r7",
      "live_mode": false,
      "order_id": "ord_0000ALiAP5a6cdSZ7Z8Lev",
      "refund_amount": "0.00",
      "refund_currency": "GBP",
      "refund_to": "awaiting_payment"
    },
    {
      "confirmed_at": "2022-07-22T00:15:53.413914Z",
      "created_at": "2022-07-22T00:15:53.159195Z",
      "expires_at": "2022-07-22T01:15:53Z",
      "id": "ore_0000ALjU4ZOqY3DduI4csS",
      "live_mode": false,
      "order_id": "ord_0000ALjU4XI4SzvGzrgkpE",
      "refund_amount": "180.07",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": "2022-07-21T08:23:43.819837Z",
      "created_at": "2022-07-21T08:23:43.654732Z",
      "expires_at": "2022-07-21T09:23:43Z",
      "id": "ore_0000ALi763TVvgwHDwHaVt",
      "live_mode": false,
      "order_id": "ord_0000ALi761c68dB8FeJzlY",
      "refund_amount": "287.82",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": "2022-07-20T14:00:39.713335Z",
      "created_at": "2022-07-20T14:00:27.422651Z",
      "expires_at": "2022-07-20T14:30:26Z",
      "id": "ore_0000ALgWdOw8lgMuzKbkBi",
      "live_mode": false,
      "order_id": "ord_0000ALgVKoY6XN77pdUODQ",
      "refund_amount": "127.17",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": null,
      "created_at": "2022-07-18T15:00:03.385828Z",
      "expires_at": "2022-07-18T16:00:03Z",
      "id": "ore_0000ALcSvSvnhgpsk9Sq5A",
      "live_mode": false,
      "order_id": "ord_0000AL963OkO78BJq62mPY",
      "refund_amount": "712.74",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": "2022-07-15T16:52:06.952709Z",
      "created_at": "2022-07-15T16:52:06.680557Z",
      "expires_at": "2022-07-15T17:52:06Z",
      "id": "ore_0000ALWPNvEglji9yowD7D",
      "live_mode": false,
      "order_id": "ord_0000ALWPNsb6wl2U0ugDjs",
      "refund_amount": "450.19",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": "2022-07-15T16:49:58.359508Z",
      "created_at": "2022-07-15T16:49:58.091333Z",
      "expires_at": "2022-07-15T17:49:58Z",
      "id": "ore_0000ALWPC3yhb1TC1YDRR0",
      "live_mode": false,
      "order_id": "ord_0000ALWPC0rVBKvaMLp9II",
      "refund_amount": "551.35",
      "refund_currency": "GBP",
      "refund_to": "balance"
    },
    {
      "confirmed_at": "2022-07-15T16:31:36.618851Z",
      "created_at": "2022-07-15T16:31:36.505323Z",
      "expires_at": "2022-07-15T17:31:36Z",
      "id": "ore_0000ALWNYTVBBDh1eBxw25",
      "live_mode": false,
      "order_id": "ord_0000ALWNYRmmP8JRv2m5PU",
      "refund_amount": "631.27",
      "refund_currency": "GBP",
      "refund_to": "balance"
    }
  ],
  "meta": {
    "after": "g3QAAAACZAACaWRtAAAAGm9yZV8wMDAwQUxXTllUVkJCRGgxZUJ4dzI1ZAALaW5zZXJ0ZWRfYXR0AAAADWQACl9fc3RydWN0X19kAA9FbGl4aXIuRGF0ZVRpbWVkAAhjYWxlbmRhcmQAE0VsaXhpci5DYWxlbmRhci5JU09kAANkYXlhD2QABGhvdXJhEGQAC21pY3Jvc2Vjb25kaAJiAAe162EGZAAGbWludXRlYR9kAAVtb250aGEHZAAGc2Vjb25kYSRkAApzdGRfb2Zmc2V0YQBkAAl0aW1lX3pvbmVtAAAAB0V0Yy9VVENkAAp1dGNfb2Zmc2V0YQBkAAR5ZWFyYgAAB-ZkAAl6b25lX2FiYnJtAAAAA1VUQw==",
    "before": null,
    "limit": 10
  }
}
